Continued from previous comment.
<details><summary>Show Output</summary>

```diff
{
          + "Name" = "natgw.eu-west-1c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-1.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.eu-west-1.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-1a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-1b.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-1c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.128.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.130.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-1b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.132.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.128.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.130.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-1b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.132.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.60.128.0/20"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "eu-west-1.int.jlyo.net"
        }
    }

  # module.aws_region_eu-west-1.aws_vpc_dhcp_options.dhcp will be created
  + resource "aws_vpc_dhcp_options" "dhcp" {
      + domain_name         = "int.jlyo.net"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_dhcp_options_association.dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.dynamodb_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.s3_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.s3_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.s3_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-1.aws_vpc_endpoint_route_table_association.s3_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_egress_only_internet_gateway.eigw will be created
  + resource "aws_egress_only_internet_gateway" "eigw" {
      + id     = (known after apply)
      + vpc_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.144.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.eu-west-2a.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-2.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.146.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.eu-west-2b.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-2.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.148.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.eu-west-2c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-2.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.eu-west-2.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-2a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-2b.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-2c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.144.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-2a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.146.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-2b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.148.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-2c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.144.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-2a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.146.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-2b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.148.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-2c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.60.144.0/20"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "eu-west-2.int.jlyo.net"
        }
    }

  # module.aws_region_eu-west-2.aws_vpc_dhcp_options.dhcp will be created
  + resource "aws_vpc_dhcp_options" "dhcp" {
      + domain_name         = "int.jlyo.net"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_dhcp_options_association.dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-2.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-2.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.dynamodb_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.dynamodb_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.dynamodb_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.dynamodb_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.s3_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.s3_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.s3_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-2.aws_vpc_endpoint_route_table_association.s3_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_egress_only_internet_gateway.eigw will be created
  + resource "aws_egress_only_internet_gateway" "eigw" {
      + id     = (known after apply)
      + vpc_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.160.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.eu-west-3a.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-3.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.162.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.eu-west-3b.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-3.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.164.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.eu-west-3c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_eu-west-3.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.eu-west-3.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-3a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-3b.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.eu-west-3c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-3a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.160.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-3a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-3b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.162.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-3b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-3c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.164.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.eu-west-3c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-3a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.160.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-3a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-3b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.162.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-3b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "eu-west-3c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.164.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.eu-west-3c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.60.160.0/20"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "eu-west-3.int.jlyo.net"
        }
    }

  # module.aws_region_eu-west-3.aws_vpc_dhcp_options.dhcp will be created
  + resource "aws_vpc_dhcp_options" "dhcp" {
      + domain_name         = "int.jlyo.net"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_dhcp_options_association.dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known a
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.